{
    "date": "23-09-2024",
    "day": "Day 9",
    "topic1": "Binary Tree",
    "topic2": "Union-Find",
    "topic1_intro": "A Binary Tree is a hierarchical data structure where each node has at most two children referred to as the left child and the right child. Binary trees are foundational in computer science and are used in various applications, such as binary search trees, heaps, and expression parsing.",
    "topic1_example": "Using a binary tree to implement a binary search tree (BST) for efficient searching and sorting.",
    "topic2_intro": "Union-Find (or Disjoint Set Union) is a data structure used to keep track of a partition of a set into disjoint subsets. It supports two primary operations: union (to merge two subsets) and find (to identify which subset a particular element is in). This structure is commonly used in network connectivity and clustering problems.",
    "topic2_example": "Using Union-Find to determine if two elements are in the same connected component of a graph.",
    "advantages": {
        "topic1": {
            "title": "Binary Tree",
            "points": [
                "Facilitates efficient data retrieval and manipulation.",
                "Supports various types of tree-based algorithms and data structures."
            ]
        },
        "topic2": {
            "title": "Union-Find",
            "points": [
                "Efficiently handles dynamic connectivity queries.",
                "Optimized for union and find operations with near constant time complexity using path compression and union by rank."
            ]
        }
    },
    "use_cases": {
        "topic1": {
            "title": "Binary Tree",
            "points": [
                "Implementing binary search trees for efficient data searching.",
                "Parsing and evaluating expressions in compilers."
            ]
        },
        "topic2": {
            "title": "Union-Find",
            "points": [
                "Finding connected components in a graph.",
                "Handling equivalence classes in clustering algorithms."
            ]
        }
    },
    "problems": [
        {
            "title": "Lowest Common Ancestor of a Binary Tree",
            "description": "Given a binary tree, find the lowest common ancestor (LCA) of two given nodes. The LCA is defined as the lowest node in the tree that has both nodes as descendants.",
            "constraints": [
                "The number of nodes in the tree is between 1 and 10⁵.",
                "Each node has a unique value."
            ],
            "examples": [
                {
                    "input": "root = [3, 5, 1, 6, 2, 0, 8, null, null, 7, 4], p = 5, q = 1",
                    "output": "3",
                    "explanation": "The lowest common ancestor of nodes 5 and 1 is node 3."
                }
            ],
            "link": "https://leetcode.com/problems/lowest-common-ancestor-of-a-binary-tree/",
            "objective": "Find the lowest common ancestor in a binary tree.",
            "key_concept": "Use traversal techniques to find the LCA by checking paths or using recursion."
        },
        {
            "title": "Number of Connected Components in an Undirected Graph",
            "description": "Given an undirected graph and a list of edges, find the number of connected components in the graph. A connected component is a subset of the graph where there is a path between any two vertices.",
            "constraints": [
                "1 ≤ `n` ≤ 10⁴",
                "1 ≤ `edges.length` ≤ 10⁵"
            ],
            "examples": [
                {
                    "input": "n = 5, edges = [[0, 1], [1, 2], [3, 4]]",
                    "output": "2",
                    "explanation": "There are two connected components: {0, 1, 2} and {3, 4}."
                }
            ],
            "link": "https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph/",
            "objective": "Count the number of connected components using Union-Find or DFS.",
            "key_concept": "Use Union-Find to track and merge connected components."
        }
    ],
    "suggested_reading": [
        {
            "title": "Understanding Binary Trees",
            "link": "https://www.geeksforgeeks.org/binary-tree-data-structure/"
        },
        {
            "title": "Union-Find Algorithm and Its Applications",
            "link": "https://www.geeksforgeeks.org/union-find/"
        }
    ]
}
